src/main/resources/xml/accommodationSalesComponentServicePort/searchAccommodationsForShare/searchAccommodationsForShare.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.service.resmanagement.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ejb:searchAccommodationsForShare>
         <!--Optional:-->
         <request>
            <travelPlanViewTO>
               <!--Optional:-->
               <agencyId>?</agencyId>
               <!--Optional:-->
               <agencyName>?</agencyName>
               <!--Optional:-->
               <agentId>?</agentId>
               <!--Optional:-->
               <arrivalDate>?</arrivalDate>
               <!--Optional:-->
               <balanceDueAmount>
                  <currency>?</currency>
                  <amount>?</amount>
               </balanceDueAmount>
               <!--Optional:-->
               <childId>?</childId>
               <!--Optional:-->
               <commissionAmount>
                  <currency>?</currency>
                  <amount>?</amount>
               </commissionAmount>
               <!--Optional:-->
               <contactName>?</contactName>
               <!--Optional:-->
               <creditCardAuthorizationCode>?</creditCardAuthorizationCode>
               <!--Optional:-->
               <creditCardExpirationDate>?</creditCardExpirationDate>
               <!--Optional:-->
               <creditCardHolderName>?</creditCardHolderName>
               <!--Optional:-->
               <creditCardNumber>?</creditCardNumber>
               <!--Optional:-->
               <creditCardTypeCode>?</creditCardTypeCode>
               <dateMatchFlag>?</dateMatchFlag>
               <!--Optional:-->
               <depatureDate>?</depatureDate>
               <depositDueNumberOfDays>?</depositDueNumberOfDays>
               <exactMatch>?</exactMatch>
               <extRefNumber>?</extRefNumber>
               <!--Optional:-->
               <externalCGroupCode>?</externalCGroupCode>
               <externalRefNumber>?</externalRefNumber>
               <!--Optional:-->
               <externalReferenceDetail>
                  <!--Optional:-->
                  <externalReferenceType>?</externalReferenceType>
                  <!--Optional:-->
                  <externalReferenceCode>?</externalReferenceCode>
                  <!--Optional:-->
                  <externalReferenceNumber>?</externalReferenceNumber>
                  <!--Optional:-->
                  <externalReferenceSource>?</externalReferenceSource>
               </externalReferenceDetail>
               <!--Optional:-->
               <externalSourceNumber>?</externalSourceNumber>
               <fullMatchFlag>?</fullMatchFlag>
               <!--Optional:-->
               <gatheringId>?</gatheringId>
               <!--Optional:-->
               <gatheringName>?</gatheringName>
               <!--Optional:-->
               <group>
                  <commissionable>?</commissionable>
                  <delegateSmallBalanceWriteOff>?</delegateSmallBalanceWriteOff>
                  <!--Optional:-->
                  <groupCode>?</groupCode>
                  <!--Optional:-->
                  <groupDescription>?</groupDescription>
                  <!--Zero or more repetitions:-->
                  <groupTeams>?</groupTeams>
                  <guaranteed>?</guaranteed>
                  <hideRate>?</hideRate>
                  <internalConfirmation>?</internalConfirmation>
                  <!--Optional:-->
                  <stage>?</stage>
                  <wholeSaler>?</wholeSaler>
               </group>
               <!--Optional:-->
               <groupName>?</groupName>
               <!--Optional:-->
               <guaranteeAmount>
                  <currency>?</currency>
                  <amount>?</amount>
               </guaranteeAmount>
               <!--Optional:-->
               <guestFirstName>?</guestFirstName>
               <!--Optional:-->
               <guestLastName>?</guestLastName>
               <includeExternalSystemItinerary>?</includeExternalSystemItinerary>
               <!--Optional:-->
               <nameSuffix>?</nameSuffix>
               <!--Optional:-->
               <nameTitle>?</nameTitle>
               <!--Optional:-->
               <paymentsRecievedAmount>
                  <currency>?</currency>
                  <amount>?</amount>
               </paymentsRecievedAmount>
               <!--Optional:-->
               <postalCode>?</postalCode>
               <primaryGuestOnly>?</primaryGuestOnly>
               <!--Optional:-->
               <reservationDate>?</reservationDate>
               <!--Optional:-->
               <resortCode>?</resortCode>
               <!--Optional:-->
               <restrictionCode>?</restrictionCode>
               <!--Optional:-->
               <roomNumber>?</roomNumber>
               <!--Optional:-->
               <roomType>
                  <!--Optional:-->
                  <accommodationFacilityTO>
                     <DVCProperty>?</DVCProperty>
                     <dmeSupported>?</dmeSupported>
                     <goodNeighborProperty>?</goodNeighborProperty>
                     <hotelPlazaProperty>?</hotelPlazaProperty>
                     <!--Optional:-->
                     <resortCode>?</resortCode>
                     <!--Optional:-->
                     <resortName>?</resortName>
                  </accommodationFacilityTO>
                  <concierge>?</concierge>
                  <!--Optional:-->
                  <roomTypeCode>?</roomTypeCode>
                  <!--Optional:-->
                  <roomTypeName>?</roomTypeName>
               </roomType>
               <!--Optional:-->
               <sourceOfBusinessCode>?</sourceOfBusinessCode>
               <!--Optional:-->
               <teamName>?</teamName>
               <!--Optional:-->
               <totalPrice>
                  <currency>?</currency>
                  <amount>?</amount>
               </totalPrice>
               <!--Optional:-->
               <travelPeriod>
                  <!--Optional:-->
                  <endDate>?</endDate>
                  <!--Optional:-->
                  <startDate>?</startDate>
               </travelPeriod>
               <!--Optional:-->
               <travelPeriodEndDate>?</travelPeriodEndDate>
               <!--Optional:-->
               <travelPeriodStartDate>?</travelPeriodStartDate>
               <travelPlanId>?</travelPlanId>
               <siebelTravelPlanId>?</siebelTravelPlanId>
               <travelPlanSegmentId>?</travelPlanSegmentId>
               <!--Optional:-->
               <travelStatus>?</travelStatus>
               <!--Optional:-->
               <travelStatusForDisplay>?</travelStatusForDisplay>
               <!--Optional:-->
               <vipLevel>?</vipLevel>
               <!--Optional:-->
               <viplevel>?</viplevel>
               <!--Optional:-->
               <viplevelForDisplay>?</viplevelForDisplay>
               <!--Optional:-->
               <yourReference>?</yourReference>
               <!--Optional:-->
               <specialNeedsRequested>?</specialNeedsRequested>
            </travelPlanViewTO>
         </request>
         <!--Optional:-->
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </ejb:searchAccommodationsForShare>
   </soapenv:Body>
</soapenv:Envelope>
